<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
<META NAME="Generator" CONTENT="Microsoft Word 97">
<TITLE>Petit exemple illustré :</TITLE>
</HEAD>
<BODY>

<B><FONT SIZE=2><P ALIGN="CENTER">Petit exemple illustr&eacute;&nbsp;:</P>
</B>
</FONT><B><FONT SIZE=4><P ALIGN="CENTER">Mardi gras &agrave; la Recherche</P>
</FONT><FONT SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">&nbsp;</P>
</FONT><P ALIGN="JUSTIFY">Introduction</P>
</B><FONT SIZE=2><P ALIGN="JUSTIFY"></P>
<I><P ALIGN="JUSTIFY">C’est Mardi gras&nbsp;! Les trois boute-en-train de la Recherche ont choisi de se d&eacute;guiser et d’apporter des cr&ecirc;pes.</P>
<P ALIGN="JUSTIFY">Pour chacun d’eux, retrouvez le d&eacute;guisement et le nombre de cr&ecirc;pes apport&eacute;es.</P>
</I><P ALIGN="JUSTIFY"></P>
</FONT><B><P ALIGN="JUSTIFY">Enonc&eacute;</P>
</B><FONT SIZE=2><P ALIGN="JUSTIFY"></P>
<OL>

<I><P ALIGN="JUSTIFY"><LI>Le r&eacute;tiaire est venu avec moins de cr&ecirc;pes que Guillaume.</LI></P>
<P ALIGN="JUSTIFY"><LI>Beno&icirc;t a cuisin&eacute; 15 cr&ecirc;pes.</LI></P>
<P ALIGN="JUSTIFY"><LI>C’est la panth&egrave;re qui est venu avec le moins de cr&ecirc;pes, mais il s’est rachet&eacute; en apportant quelques bouteilles de cidre.</LI></P></OL>

</I><P ALIGN="JUSTIFY"></P>
</FONT><B><P ALIGN="JUSTIFY">Grille et tableau de la solution</P>
</B><FONT SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="CENTER"><IMG SRC="ExempleIllustre1.gif"></P>
<P ALIGN="JUSTIFY"></P>
<U><P ALIGN="JUSTIFY">A la lecture du premier indice</U>, il vient naturellement que <B>le r&eacute;tiaire n’est pas venu avec 20 cr&ecirc;pes</B>, puisque c’est le maximum, et que Guillaume en a apport&eacute; plus. De fa&ccedil;on sym&eacute;trique, <B>Guillaume n’est pas venu avec 10 cr&ecirc;pes</B>. Ne pas oublier non plus que si Guillaume n’a pas le m&ecirc;me nombre de cr&ecirc;pes que le r&eacute;tiaire, alors forc&eacute;ment <B>Guillaume n’&eacute;tait pas d&eacute;guis&eacute; en r&eacute;tiaire</B>. Reportons ces d&eacute;ductions dans la grille. On signifie que la relation <I>R&eacute;tiaire/20 cr&ecirc;pes</I> est n&eacute;gative en pla&ccedil;ant </FONT><I><FONT SIZE=2 COLOR="#ff0000">une croix X</I></FONT><FONT SIZE=2> dans la case correspondante, de coordonn&eacute;es <B>B6</B>. Les deux autres clauses m&egrave;nent &agrave; placer une croix respectivement en <B>D2</B> et <B>B2</B>.</P>

<P><IMG SRC="ExempleIllustre2.gif"></P>
<U><P ALIGN="JUSTIFY">Le second indice est beaucoup plus simple</U>, puisqu’il se compose d’une clause explicite. Nous &eacute;tablissons une relation positive sur <I>Beno&icirc;t/15 cr&ecirc;pes</I>. Cette information est report&eacute;e dans la grille en pla&ccedil;ant </FONT><I><FONT SIZE=2 COLOR="#ff0000">un rond O</I></FONT><FONT SIZE=2> en <B>E1</B>. Nous avons extrait toutes les d&eacute;ductions possibles de cet indice. En revanche, des d&eacute;ductions implicites sont encore &agrave; d&eacute;duire au sein de la grille. En effet, si Beno&icirc;t a 15 cr&ecirc;pes, et en appliquant le <B>th&eacute;or&egrave;me de l’enfon&ccedil;age de portes ouvertes</B>, alors il vient qu’il n’en apporta ni 10, ni 20. Pla&ccedil;ons donc des croix respectivement en <B>D1</B> et <B>F1</B>. De la m&ecirc;me mani&egrave;re, si 15 cr&ecirc;pes ont &eacute;t&eacute; apport&eacute;es par Beno&icirc;t, alors elles n’ont &eacute;t&eacute; cuisin&eacute;es ni par Guillaume, ni par Jean-Jacques, d’apr&egrave;s le th&eacute;or&egrave;me cit&eacute; pr&eacute;c&eacute;demment. Nous placerons donc gentiment des croix en <B>E2</B> et <B>E3</B>. Du coup et par application du <B>th&eacute;or&egrave;me des chaises musicales</B>, il ne reste plus qu’une possibilit&eacute; pour Guillaume&nbsp;: c’est 20 cr&ecirc;pes et donc un rond en <B>F2</B>. De m&ecirc;me, il reste 10 cr&ecirc;pes pour Jean-Jacques, soit un rond en <B>D3</B>.</P>
<P><IMG SRC="ExempleIllustre3.gif"></P>

<U><P>Le troisi&egrave;me indice est aussi tr&egrave;s simple</U>, mais sa d&eacute;duction explicite (<B>la panth&egrave;re vint avec 10 cr&ecirc;pes</B>), qui nous fait placer un rond en <B>A4</B>, entra&icirc;ne une avalanche de d&eacute;ductions implicites au sein de la grille, jusqu’&agrave; la solution! Tout d’abord, on placera des croix en <B>A/5,6</B> et <B>B,C/4</B> par application du th&eacute;or&egrave;me de l’enfon&ccedil;age de portes ouvertes. Le th&eacute;or&egrave;me des chaises musicales conduit &agrave; placer un rond en <B>B5</B> et, du coup, en <B>C6</B>. Par application du th&eacute;or&egrave;me des amis de mes amis sont mes amis, si la panth&egrave;re avait 10 cr&ecirc;pes, et que Jean-Jacques apporta 10 cr&ecirc;pes, alors Jean-Jacques &eacute;tait d&eacute;guis&eacute; en panth&egrave;re, et on place un rond en <B>A3</B>. Appliquons le th&eacute;or&egrave;me de l’enfon&ccedil;age de portes ouvertes, suivi du th&eacute;or&egrave;me des chaises musicales&nbsp;: la grille est compl&eacute;t&eacute;e&nbsp;!</P>

<P ALIGN="CENTER"><IMG SRC="ExempleIllustre4.gif"></P>

<P>&nbsp;</P>
<P>Retenez bien les trois th&eacute;or&egrave;mes&nbsp;:</P>

<UL>
<B><P ALIGN="JUSTIFY"><LI>Enfon&ccedil;age de portes ouvertes&nbsp;:</B> lorsqu’on place une affirmation (</FONT><FONT SIZE=2 COLOR="#ff0000">un rond O</FONT><FONT SIZE=2>) dans la grille, cela donne que les autres cases vierges de la ligne et de la colonne sont des n&eacute;gations (</FONT><FONT SIZE=2 COLOR="#ff0000">des croix X</FONT><FONT SIZE=2>).</LI></P>
<B><P ALIGN="JUSTIFY"><LI>Chaises musicales&nbsp;:</B> lorsqu’il ne reste plus qu’une case vierge, sur une ligne ou une colonne charg&eacute;e de n&eacute;gations, alors il s’agit d’une affirmation.</LI></P>
<B><P ALIGN="JUSTIFY"><LI>Amis de mes amis sont mes amis&nbsp;:</B> relation de Chasles op&eacute;r&eacute;e sur les affirmations&nbsp;: si (A, B) vrai et (B, C) vrai alors (A, C) vrai.</LI></P>
<P ALIGN="JUSTIFY"><LI></LI></P></UL>

<P>Note&nbsp;: un th&eacute;or&egrave;me pourra vous servir dans le jeu concours. Il s’agit du <B>th&eacute;or&egrave;me des ennemis de mes amis sont mes ennemis</B> qui dit que «&nbsp;si (A, B) vrai et (B, C) faux alors (A, C) faux&nbsp;». Illustrons ceci sur l’exemple pr&eacute;c&eacute;dent&nbsp;: si Guillaume est une teigne et que la teigne n’a pas apport&eacute; 15 cr&ecirc;pes, alors Guillaume n’a pas apport&eacute; 15 cr&ecirc;pes.</P>
</FONT></BODY>
</HTML>
